NSCameraUsageDescription = "Idhini ya kufikia kamera inahitajika ili kuchanganua hati na kutengeneza picha na video.";
NSFaceIDUsageDescription = "Kitambulisho cha Uso kinahitajika ili kuthibitisha kwa kutumia utambuzi wa uso.";
NSLocationAlwaysUsageDescription = "Programu hutumia eneo lako kuanzisha upakiaji wa faili kiotomatiki unaposogea kati ya maeneo.";
NSPhotoLibraryUsageDescription = "Ufikiaji wa maktaba ya picha unahitajika ili kupakia picha na video zako kwenye cloud yako.";
NSPhotoLibraryAddUsageDescription = "Ufikiaji wa maktaba ya picha unahitajika ili kupakia picha na video zako kwenye cloud yako.";
NSMicrophoneUsageDescription = "Ufikiaji wa maikrofoni unahitajika ili kuunda madokezo ya sauti.";
NSLocationWhenInUseUsageDescription = "Programu hii hutumia eneo lako kutambua harakati na kupakia faili kiotomatiki. Haitumii GPS na haihifadhi eneo lako.";
NSLocationAlwaysAndWhenInUseUsageDescription = "Programu hii inahitaji ufikiaji wa eneo lako hata chinichini ili kuanza kupakia faili kiotomatiki wakati harakati kubwa inapogunduliwa. GPS haitumiki.";
